Revit 2027 API
TrussMemberInfo.hostTrussId Property
The host truss' ElementId of the member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId hostTrussId { get; set; }
Public Property hostTrussId As ElementId
	Get
	Set
public:
property ElementId^ hostTrussId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member hostTrussId : ElementId with get, set
Property Value
ElementId
See Also
Reference
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace